MediHome_proyecto/MediHome/diagrama/MediHome.dot
digraph G {
graph [rankdir=TB, splines=polyline, nodesep=0.55, ranksep=1.0, pad=0.4, bgcolor="white", fontname="Arial"];
node [shape=plain, fontname="Arial"];
edge [fontname="Arial", fontsize=10, color="#34576b", arrowsize=0.8];
INotificable [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9">&lt;&lt;interface&gt;&gt;<BR/><B>INotificable</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">&#160;</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+notificar(mensaje: String): void</FONT></TD></TR></TABLE>>];
Usuario [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9">&lt;&lt;abstract&gt;&gt;<BR/><B>Usuario</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-identificacion: String<BR ALIGN="LEFT"/>-nombre: String<BR ALIGN="LEFT"/>-correo: String</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+getIdentificacion(): String<BR ALIGN="LEFT"/>+getNombre(): String<BR ALIGN="LEFT"/>+getCorreo(): String<BR ALIGN="LEFT"/>+notificar(mensaje: String): void</FONT></TD></TR></TABLE>>];
Empresa [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>Empresa</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-identificacion: String<BR ALIGN="LEFT"/>-nombre: String<BR ALIGN="LEFT"/>-correo: String<BR ALIGN="LEFT"/>-telefono: String<BR ALIGN="LEFT"/>-direccionPrincipal: String</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+agregarEquipo(equipo: EquipoMedico): void</FONT></TD></TR></TABLE>>];
EquipoMedico [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>EquipoMedico</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-codigo: String<BR ALIGN="LEFT"/>-nombre: String<BR ALIGN="LEFT"/>-zonaCobertura: String</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+agregarProfesional(profesional: ProfesionalSalud): void<BR ALIGN="LEFT"/>+quitarProfesional(profesional: ProfesionalSalud): void</FONT></TD></TR></TABLE>>];
ProfesionalSalud [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>ProfesionalSalud</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-numeroRegistroProfesional: String<BR ALIGN="LEFT"/>-especialidad: String</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+getEspecialidad(): String</FONT></TD></TR></TABLE>>];
Paciente [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>Paciente</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-telefono: String<BR ALIGN="LEFT"/>-direccion: String</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+getTelefono(): String<BR ALIGN="LEFT"/>+getDireccion(): String</FONT></TD></TR></TABLE>>];
EstadoServicio [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9">&lt;&lt;enumeration&gt;&gt;<BR/><B>EstadoServicio</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">SOLICITADO<BR ALIGN="LEFT"/>PROGRAMADO<BR ALIGN="LEFT"/>EN_ATENCION<BR ALIGN="LEFT"/>FINALIZADO<BR ALIGN="LEFT"/>CANCELADO</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">&#160;</FONT></TD></TR></TABLE>>];
ServicioDomiciliario [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>ServicioDomiciliario</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-codigoUnico: String<BR ALIGN="LEFT"/>-fechaHora: LocalDateTime<BR ALIGN="LEFT"/>-direccionAtencion: String<BR ALIGN="LEFT"/>-motivo: String<BR ALIGN="LEFT"/>-estado: EstadoServicio</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+programar(profesional: ProfesionalSalud): void<BR ALIGN="LEFT"/>+iniciarAtencion(inicio: LocalDateTime): AtencionMedica<BR ALIGN="LEFT"/>+cancelar(): void</FONT></TD></TR></TABLE>>];
AtencionMedica [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>AtencionMedica</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-fechaHoraInicio: LocalDateTime<BR ALIGN="LEFT"/>-fechaHoraFinalizacion: LocalDateTime<BR ALIGN="LEFT"/>-observaciones: String<BR ALIGN="LEFT"/>-recomendaciones: String</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">+registrarMedicion(medicion: MedicionSignos): void<BR ALIGN="LEFT"/>+finalizar(fin: LocalDateTime, observaciones: String, recomendaciones: String): void</FONT></TD></TR></TABLE>>];
MedicionSignos [label=<<TABLE BORDER="1" CELLBORDER="0" CELLSPACING="0" COLOR="#397da0"><TR><TD BGCOLOR="#8dd3f2" ALIGN="CENTER" CELLPADDING="9"><B>MedicionSignos</B></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">-fechaHora: LocalDateTime<BR ALIGN="LEFT"/>-temperatura: double<BR ALIGN="LEFT"/>-frecuenciaCardiaca: int<BR ALIGN="LEFT"/>-presionSistolica: int<BR ALIGN="LEFT"/>-presionDiastolica: int<BR ALIGN="LEFT"/>-saturacionOxigeno: double</FONT></TD></TR><TR><TD ALIGN="LEFT" BALIGN="LEFT" CELLPADDING="7" BGCOLOR="#eaf8fe"><FONT POINT-SIZE="10">&#160;</FONT></TD></TR></TABLE>>];
Paciente -> Usuario [arrowhead=empty, penwidth=1.5];
ProfesionalSalud -> Usuario [arrowhead=empty, penwidth=1.5];
Usuario -> INotificable [style=dashed, arrowhead=empty];
Empresa -> EquipoMedico [dir=both, arrowtail=odiamond, arrowhead=none, label="organiza", headlabel="0..*", taillabel="1"];
EquipoMedico -> ProfesionalSalud [dir=both, arrowtail=odiamond, arrowhead=none, label="pertenece", headlabel="0..*", taillabel="0..1"];
Paciente -> ServicioDomiciliario [dir=none, label="solicita", taillabel="1", headlabel="0..*"];
ProfesionalSalud -> ServicioDomiciliario [dir=none, label="atiende", taillabel="0..1", headlabel="0..*"];
ServicioDomiciliario -> AtencionMedica [dir=both, arrowtail=diamond, arrowhead=none, label="genera", headlabel="0..1", taillabel="1"];
AtencionMedica -> MedicionSignos [dir=both, arrowtail=diamond, arrowhead=none, label="registra", headlabel="0..*", taillabel="1"];
ServicioDomiciliario -> EstadoServicio [style=dashed, arrowhead=open];
}
